nh-tu-z/stm32_firmware/main_official.c
//official version
#include "stm32f4xx.h"
#include "system_timetick.h"
#include "string.h"
#include "stdlib.h"
#include "stdio.h"
#include "stdbool.h"
#include "stm32f4xx_dma.h"
#include "stm32f4xx_usart.h"

#define		BUFF_SIZE_UART2			128
#define   BUFF_SIZE_UART3  500
#define   BUFFER_MAX_SIZE 128
#define   x              8
#define BUFFER_FULL 2 // Buffer day
#define BUFFER_OK 1 // Ham thuc hien thanh cong
#define BUFFER_EMPTY 0 // Buffer rong
#define BUFFER_NO_CR -1 // Ðoc buffer khong tim duoc <CR>
#define true  1
#define false 0
//#define EEPROM_ADDR 0x50

#define TIME_STRUCT_SIZE 0x08
#define RAM_SIZE 55
#define BCD2BIN(val) (((val)&15) + ((val)>>4)*10)
#define BIN2BCD(val) ((((val)/10)<<4) + (val)%10)


#define RTC_DS1307_OK       0
#define RTC_DS1307_BAD     -1
#define eerom_OK            0
#define eerom_BAD           -1
#define DS1307_ADDRESS      0x68

#define SECOND_REGISTER    0x00
#define MINUTE_REGISTER    0x01
#define HOUR_REGISTER      0x02
#define DAY_REGISTER       0x03
#define DATE_REGISTER      0x04
#define MONTH_REGISTER     0x05
#define YEAR_REGISTER      0x06
#define CONTROL_REGISTER   0x07

#define SECOND_MASK        0x7F
#define MINUTE_MASK        0x7F
#define HOUR_MASK          0x3F
#define DAY_MASK           0x07
#define DATE_MASK          0x3F
#define MONTH_MASK         0x1F
#define YEAR_MASK          0xFF
#define FLAG_MASK          0xFF

#define RESET_FLAG_ON      0x80
#define RESET_FLAG_OFF     0x00
#define TRICKLE_SETTING    0xA7


#define MAX_STR_LEN 128
#define DEFAULT_WAIT_TIME 5000000u

#define EEPROMADDR          0x50 <<1
#define EEP24CXX_ADDR_WRITE	0xA0
#define EEP24CXX_ADDR_READ	0xA1
#define EEPROM_ADDRESS      0xA0
uint8_t I2c_Buf_Write[256];
uint8_t I2c_Buf_Read[256];
#define I2CT_FLAG_TIMEOUT  ((uint32_t)0x1000)
#define I2CT_LONG_TIMEOUT  ((uint32_t)(10 * I2CT_FLAG_TIMEOUT))
#define  EEP_Firstpage      0x00
#define I2C_PageSize        8

/* Lenh doc 30 thanh ghi tu thanh ghi 0x00 theo Modbus RTU */
//const char txbuff[8] = {0x01, 0x04, 0x00, 0x00, 0x00, 0x3C, 0xF0,0x1B};

  
unsigned int g_return_value;

float	neutralVolt_phase1;
float neutralVolt_phase2;
float neutralVolt_phase3;
float electricity_neutralVolt;
float lineVolt_phase1 ;
float	lineVolt_phase2;
float	lineVolt_phase3 ;
float electricity_lineVolt;
float	current_phase1 ;
float current_phase2 ;
float current_phase3 ;
float electricity_current ;
float kW_phase1 ;
float kW_phase2 ;
float kW_phase3 ;
float kVA_phase1 ;
float kVA_phase2 ;
float kVA_phase3;
float kVAr_phase1 ;
float kVAr_phase2 ;
float kVAr_phase3 ;
float electricity_kW ;
float electricity_kVA ;
float electricity_kVAr;
float PF_phase1 ;
float PF_phase2;
float PF_phase3 ;
float electricity_PF ;
float electricity_frequency;
float electricity_kWh ;


typedef struct {
    uint8_t year;       // year (0 - 99)
    uint8_t month;      // month (01 - 12)
    uint8_t date;       // date (01 - 31)
    uint8_t day;        // day (01 - 07)
    uint8_t hour;       // hour (00 - 23)
    uint8_t minutes;    // minutes (00 - 59)
    uint8_t seconds;    // seconds (00 - 59)
} rtc_ds1307_datetime_t;
/* Bien dành cho RTC */
typedef struct
{

I2C_TypeDef i2c;

rtc_ds1307_datetime_t time;

char timeStr[20];

char dateStr[20];

char dateTimeStr[20];
} rtc_t;

typedef struct
{
USART_TypeDef *gate;
/* Bien de nhan du lieu */
char rxChar;
} uart_t;

typedef struct
{

GPIO_TypeDef *port;
/* Thu tu Pin cua GPIO */
uint16_t pin;
/* Trang thai tich cuc cua GPIO */
int8_t activeState;
/* Trang thai hien tai cua GPIO */
int8_t status;
} gpio_t;

typedef struct
{
/* Mang de luu du lieu*/
char array[BUFFER_MAX_SIZE];
/* Con tro doc */
uint32_t iR;
/* Con tro ghi */
uint32_t iW;
} buffer_t;


/* Bien luu các giá tri ba pha */
typedef struct
{
float phase1;
float phase2;
float phase3;
} threePhase_t;


/* Bien luu các giá tri dòng dien */
typedef struct
{
float lineVolt;
float neutralVolt;
float current;
float kW;
float kVA;
float kVAr;
float PF;
float frequency;
float kWh;
} electricity_t;


/* Bien dành cho SELEC */
typedef struct
{
uart_t uart;
buffer_t buffer;
bool requestSent;
bool gotResponse;
char rxString[128];
gpio_t driveEnable;
electricity_t electricity;
threePhase_t lineVolt;
threePhase_t neutralVolt;
threePhase_t current;
threePhase_t kW;
threePhase_t kVA;
threePhase_t kVAr;
threePhase_t PF;
	float tt;
} selec_t;


typedef struct
{
I2C_TypeDef *gate;
// dia chi thiet bi
uint8_t devAddress;
// kich thuoc o nho thiet bi
uint8_t memAddSize;
} i2c_t;

typedef struct
{
/* Cong I2C tuong ung voi EEPROM */
i2c_t i2c;
gpio_t writeProtect;
} eeprom_t;

char echo[100];
bool m=0;
bool test=0;
bool relay=0;
/* var control tasks */
	bool enable_start_up=true;
	bool enable_start_mqtt=false;
	bool enable_pub_data = false;
/**/
char 	rxbuff_uart2[BUFF_SIZE_UART2];
char 	rxbuff_3[BUFF_SIZE_UART3];
char EEROM[500];
uint8_t ds_data;
/*  */
uint16_t pre_NDTR_USART2;
uint16_t pre_NDTR_USART3;
uint16_t Timingdelay;
char buffer[MAX_STR_LEN];
char buffer_selec[32];
uint32_t count;
uint16_t time_second=0;
void delay_01ms(uint16_t period);
void init_main(void);



void receive(USART_TypeDef* USARTx,char *text, uint16_t length);
float SELEC_dataConvert(char *firstByteAdd);
void I2C_start(I2C_TypeDef* I2Cx, uint8_t address, uint8_t direction);
uint8_t I2C_read_ack(I2C_TypeDef* I2Cx);
uint8_t I2C_read_nack(I2C_TypeDef* I2Cx);
void I2C_stop(I2C_TypeDef* I2Cx);
void I2C_write(I2C_TypeDef* I2Cx, uint8_t data);

void display_rtc(rtc_ds1307_datetime_t *rtc_datetime);
unsigned int ds1307_bcd2bin (unsigned int bcd_value);
unsigned int ds1307_bin2bcd (unsigned int binary_value);
int ds1307_set_rtc_data (char register_value, char data);
int ds1307_get_rtc_data (char register_value, char register_mask,unsigned int *return_value);
void ds1307_set_rtc_second (unsigned int value);
void ds1307_set_rtc_minute (unsigned int value);
void ds1307_set_rtc_hour (unsigned int value);
void ds1307_set_rtc_day (unsigned int value);
void ds1307_set_rtc_date (unsigned int value);
void ds1307_set_rtc_month (unsigned int value);
void ds1307_set_rtc_year (unsigned int value);
void ds1307_reset_osf (void);
int ds1307_set_rtc_datetime (rtc_ds1307_datetime_t* datetime);
int ds1307_get_rtc_second (void);
int ds1307_get_rtc_minute (void);
int ds1307_get_rtc_hour (void);
int ds1307_get_rtc_day (void);
int ds1307_get_rtc_date (void);
int ds1307_get_rtc_month (void);
int ds1307_get_rtc_year (void);
int ds1307_get_rtc_datetime (rtc_ds1307_datetime_t *datetime);
int ds1307_init_rtc (int first_run_flag);
void USART_put(USART_TypeDef* USARTx, volatile char *s);
bool checkAddreses(const uint8_t start_address, const uint8_t allocated_bytes);
void write_eeprom (uint16_t Address, char *data,const uint8_t bytes);
void eeprom_writeData(rtc_ds1307_datetime_t *datetime,char register_value, const uint8_t bytes);
uint8_t* read_eeprom(uint16_t Address,const uint8_t allocated_bytes);
uint8_t* encodeData(const rtc_ds1307_datetime_t *datetime);
uint8_t* readTime(void);
void decodeTime(const uint8_t *data, rtc_ds1307_datetime_t *rtc_datetime);
//void write_24CXX (uint16_t Addr, uint16_t data);
//uint8_t read_24CXX(uint16_t Addr);
//void EEP24CXX_WriteMultiData(uint16_t Addr, uint16_t Quantity, uint8_t *Buff_Data);
//void EEP24CXX_ReadMultiData(uint16_t Addr, uint16_t Quantity, uint8_t *Buff_Data);
//void Wait_for_EEPROM(void);
uint16_t DMA_rx(void);

uint8_t eeprom_at24cxx_read_multi(uint8_t* memaddress,uint16_t address,uint16_t num_of_byte);
static uint8_t eeprom_at24cxx_write_page(uint8_t* memaddress,	uint16_t pageaddress,uint16_t num_of_byte);
uint8_t eeprom_at24cxx_write_multi(uint8_t* memaddress,uint16_t romaddress,uint16_t num_of_byte);
uint32_t lengthString(char *string);
	bool clearString(char *srcString);
/* Declare Func */	
void pwr(bool isSet);
void start_mqtt(uint16_t timeDelay);
void stop_mqtt(uint16_t timeDelay);
void subcribe_mqtt_topic(uint16_t timeDelay, char topic[]);
void public_data(uint16_t timeDelay, char topic[], uint8_t data[]);
bool detect_string(char stringIn[], char detectString[]);
void print_uart2(char *text, uint16_t length);
void print_uart4(char *text, uint16_t length);
void print_uart3(char *text, uint16_t length);
void send_SELEC(void);
uint8_t bcd2asc(uint8_t bcd);
int main(void){
//SysTick_Config(SystemCoreClock/1000);
	init_main();
	
