nh-tu-z/stm32_firmware/main_official.c
	uint8_t Buff_Str[89];
  uint8_t Buff_Str1[89];
	uint8_t Buff_Str2[126];
	rtc_ds1307_datetime_t  rtc_datetime;
	 char buffer[MAX_STR_LEN];
    uint32_t count;   

	bool m=0;
	bool stop=0;
     ds1307_init_rtc(1);  // init the ds1307 RTC for first time
	//GPIO_SetBits(GPIOB,GPIO_Pin_2);
	while(1){
		/* Start Up */
		pwr(enable_start_up);
		
		/* Task 1: Check NET and start MQTT service */	
		if(enable_start_mqtt){
				start_mqtt(20000);
				/* Detect ERROR when connecting to MQTT Broker */
				while(detect_string(echo,"ERROR"))
				{				
					stop_mqtt(20000);
					start_mqtt(20000);
					/* Delete Received String after detecting error */
					clearString(echo);
				}	
				subcribe_mqtt_topic(20000,"VINH_1");
				/* Disable Task 1 and Enable Task 2 */
				enable_start_mqtt=false;
				enable_pub_data = true;
		}
		
		/* Task 2: Get data from cabinet and PUBLIC to SERVER */
		if(enable_pub_data){
			send_SELEC();
			public_data(20000, "VINH", Buff_Str1);
	}

//USART_put(USART3, "Main loop entered.\r\n");
        if (ds1307_get_rtc_datetime(&rtc_datetime) != RTC_DS1307_OK) {
            //USART_put(USART3, "!!!! not get ds1307 RTC datetime\n");
        }
       //display_rtc(&rtc_datetime);
           
				sprintf((char *) &Buff_Str,"{\"date\":\"%d\",\"month\":\"%d\",\"year\":\"%d\",\"day\":\"%d\",\"hour\":\"%d\",\"minutes\":\"%d\",\"seconds\":\"%d\"}",rtc_datetime.date, rtc_datetime.month,rtc_datetime.year,rtc_datetime.day,
 rtc_datetime.hour, rtc_datetime.minutes,rtc_datetime.seconds);
//				sprintf((char *) &Buff_Str,"%d-%d-%d-%d %d:%d:%d\r\n",rtc_datetime.date, rtc_datetime.month,rtc_datetime.year,rtc_datetime.day,
//  rtc_datetime.hour, rtc_datetime.minutes,rtc_datetime.seconds);
				eeprom_at24cxx_write_multi(Buff_Str,0x00,89);
//				
//       //delay_01ms(1000);
			  eeprom_at24cxx_read_multi((uint8_t*)Buff_Str1,0x00,89);
				
//				eeprom_at24cxx_write_multi(buffer_selec,0x91,126);
//			eeprom_at24cxx_read_multi((uint8_t*)Buff_Str2,0x91,126);
	count++;
//	print_f(USART3,(char *)&Buff_Str1,110);	
//	print_f(USART3,"\r\n",2);
//print_f(USART3,(char *)txbuff,8);
  delay_01ms(5000);
}

}
/* Func Start Up */
void pwr(bool isSet) {
	if(isSet) {
		GPIO_SetBits(GPIOA, GPIO_Pin_6);
	}
	else {
		GPIO_ResetBits(GPIOA, GPIO_Pin_6);
	}
}
		/* Execute AT Function */
/* Func Start MQTT Service - Delay time is ms and uint16_t max is 65535 */
void start_mqtt(uint16_t timeDelay) {
		print_uart2("AT+CMQTTSTART\r\n",strlen("AT+CMQTTSTART\r\n"));
		delay_01ms(timeDelay);
		print_uart2("AT+CMQTTACCQ=0,\"CLIENT1\"\r\n",strlen("AT+CMQTTACCQ=0,\"CLIENT1\"\r\n"));
	  delay_01ms(timeDelay);
		print_uart2("AT+CMQTTCONNECT=0,\"tcp://broker.hivemq.com\",60,1\r\n",strlen("AT+CMQTTCONNECT=0,\"tcp://broker.hivemq.com\",60,1\r\n"));
		delay_01ms(timeDelay);
}

/* Func Stop MQTT Service - Delay time is ms and uint16_t max is 65535 */
void stop_mqtt(uint16_t timeDelay) {
		print_uart2("AT+CMQTTREL=0\r\n",strlen("AT+CMQTTREL=0\r\n"));
		delay_01ms(timeDelay);
		print_uart2("AT+CMQTTSTOP\r\n",strlen("AT+CMQTTSTOP\r\n"));
		delay_01ms(timeDelay);
}

/* Func Subscribe a TOPIC  */
void subcribe_mqtt_topic(uint16_t timeDelay, char topic[]){
		print_uart2("AT+CMQTTSUBTOPIC=0,6,1\r\n",strlen("AT+CMQTTSUBTOPIC=0,6,1\r\n"));
	  delay_01ms(timeDelay);
		print_uart2(topic,strlen(topic));
	  delay_01ms(timeDelay);
		print_uart2("AT+CMQTTSUB=0,6,1\r\n",strlen("AT+CMQTTSUB=0,6,1\r\n"));
		delay_01ms(timeDelay);
		print_uart2(topic,strlen(topic));
	  delay_01ms(timeDelay);
}
/* Func Request Data From SELEC */
void send_SELEC(void){
		uint8_t txbuff[8] = {0x01, 0x04, 0x00, 0x00, 0x00, 0x3C, 0xF0,0x1B};
    print_uart3((char *)txbuff, 8);	
}

/* Func Public Cabinet Data To Server */
void public_data(uint16_t timeDelay, char topic[], uint8_t data[]){
		print_uart2("AT+CMQTTTOPIC=0,4\r\n",strlen("AT+CMQTTTOPIC=0,4\r\n"));
	  delay_01ms(timeDelay);
	  print_uart2(topic,strlen(topic));
	  delay_01ms(timeDelay);
		print_uart2("AT+CMQTTPAYLOAD=0,89\r\n",strlen("AT+CMQTTPAYLOAD=0,89\r\n"));
		delay_01ms(timeDelay);
		print_uart2((char*)data,strlen((char*)data));
		delay_01ms(timeDelay);
		print_uart2("AT+CMQTTPUB=0,1,60\r\n",strlen("AT+CMQTTPUB=0,1,60\r\n"));
		delay_01ms(timeDelay);
}
		/* Execute Process Function */
/* Func Delay  */
void delay_01ms(uint16_t period){

  	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, ENABLE);
  	TIM6->PSC = 8399;		// clk = SystemCoreClock /2 /(PSC+1) = 10KHz
  	TIM6->ARR = period-1;
  	TIM6->CNT = 0;
  	TIM6->EGR = 1;		// update registers;

  	TIM6->SR  = 0;		// clear overflow flag
  	TIM6->CR1 = 1;		// enable Timer6

  	while (!TIM6->SR);
    
  	TIM6->CR1 = 0;		// stop Timer6
  	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM6, DISABLE);
}
/* Fuc Check String In String */
bool detect_string(char stringIn[], char detectString[]) {
		char *isDetected;
		isDetected = strstr(stringIn, detectString);
		//print_uart4(isDetected,1);
		if(isDetected == NULL)
		{		
			return false;
		}
		return true;		
}
/* Func Detect and get message length function */
uint16_t get_mess_from_rx(DMA_Stream_TypeDef* DMAy_Streamx, uint16_t *pre_NDTRx, uint32_t buff_size, uint32_t flag){ 
	if(*pre_NDTRx != DMAy_Streamx->NDTR) 
		{
			*pre_NDTRx = DMAy_Streamx->NDTR;
			return 0;
		}
		if((*pre_NDTRx == DMAy_Streamx->NDTR)&&(*pre_NDTRx == buff_size))
		{	
			return 0;
		}
		DMA_Cmd(DMAy_Streamx, DISABLE);		
		DMAy_Streamx->NDTR = (uint32_t)buff_size;
		DMA_ClearFlag(DMAy_Streamx, flag);
		DMA_Cmd(DMAy_Streamx, ENABLE);
		return (uint16_t)(buff_size - *pre_NDTRx);
}
/* Func Convert BCD To ASCII */
uint8_t bcd2asc(uint8_t bcd){
	return bcd + 0x30;
}
		/* UART */
/* Func Transmit multi bytes in Tx in USART2 */
void print_uart2(char *text, uint16_t length){
	for(int i = 0; i<length; i++)
	{
		while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET) 
		{}
		USART_SendData(USART2, (uint8_t)text[i]);
	}
}
/* Func Transmit multi bytes in Tx in USART3 */
void print_uart3(char *text, uint16_t length){
	for(int j = 0; j<length; j++)
	{
		while (USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET) 
		{}
		USART_SendData(USART3, (uint8_t)text[j]);
	}
}
/* Func Transmit multi bytes in Tx in UART4 */
void print_uart4(char *text, uint16_t length){
	for(int j = 0; j<length; j++)
	{
		while (USART_GetFlagStatus(UART4, USART_FLAG_TC) == RESET) 
		{}
		USART_SendData(UART4, (uint8_t)text[j]);
	}
}
/* Func RTC Transmit */
void USART_put(USART_TypeDef* USARTx, volatile char *s) {
    while(*s){
		  // wait until data register is empty
		  while( !(USARTx->SR & 0x00000040) )
				;
		      USART_SendData(USARTx, *s);
		  *s++;
    }
}
/* */
void display_rtc(rtc_ds1307_datetime_t *rtc_datetime) {
    char buffer[MAX_STR_LEN];

//    sprintf( (char *) &buffer[0], "rtc_datetime\r\n\t->seconds = %d\r\n" \
//            "\t->minutes = %d\r\n\t->hour = %d\r\n\t->day = %d\r\n" \
//            "\t->date = %d\r\n\t->month = %d\r\n\t->year = %d\r\n\r\n", 
//            rtc_datetime->seconds, rtc_datetime->minutes, rtc_datetime->hour, 
//            rtc_datetime->day, rtc_datetime->date, rtc_datetime->month, 
//            rtc_datetime->year);

		sprintf((char *) &buffer[0],"%d-%d-%d-%d %d:%d:%d\r\n",rtc_datetime->date, rtc_datetime->month,rtc_datetime->year,rtc_datetime->day,
    rtc_datetime->hour, rtc_datetime->minutes,rtc_datetime->seconds);
		//USART_put(USART3, (char *) &buffer[0]);

    return;
}
/* */
float SELEC_dataConvert(char *firstByteAdd){ 
uint16_t uint16_high = (uint16_t) * (firstByteAdd + 0) << 8 |*(firstByteAdd + 1);
/* Hop 2 bien char 8 bit thanh bien int 16 bit thap */
uint16_t uint16_low = (uint16_t) * (firstByteAdd + 2) << 8 |*(firstByteAdd + 3);
/* Hop 2 bien int 16 bit thanh bien long int 32 bit cao */
uint32_t uint32 = (uint32_t)uint16_high << 16 | uint16_low;
/* Ép kieu du lieu sang float 32 bit */
float float32 = *(float *)(&uint32);
return float32;
}




		/* Config STM32F407 */
void init_main(void)
{
  GPIO_InitTypeDef 	GPIO_InitStructure; 
	USART_InitTypeDef USART_InitStructure; 
	DMA_InitTypeDef   DMA_InitStructure;
	NVIC_InitTypeDef	NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	I2C_InitTypeDef    I2C_InitStructure;
	EXTI_InitTypeDef EXTI_InitStructure;
  
  /* GPIOA Peripheral clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
	/* GPIOB Peripheral clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
	/* GPIOC Peripheral clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	/* GPIOD Peripheral clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
	/* Enable I2C1 clock state */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);
	/* Enable SYSCFG clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);	

	/* Enable USART1 clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
  /* Enable USART2 clock */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2 , ENABLE);
	/* Enable USART3 clock */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3 , ENABLE);
	/* Enable UART4 clock */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4 , ENABLE);
	
	/* Enable DMA1 clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1, ENABLE);
	
	/* TIM7 Peripheral clock enable */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);
	
	/* Configure GPIOA in OUTPUT pushpull mode */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
	
