nh-tu-z/stm32_firmware/main_official.c
	/* Enable USART3 DMA */
  USART_DMACmd(USART3, USART_DMAReq_Rx, ENABLE);
	
  /* Config SDA and SCL pin for I2C1 */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 ;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF ;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_OD; // set output to open drain --> the line has to be only pulled low, not driven high
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_I2C1); // SCL
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_I2C1); // SDA

  /* Config I2C1 */
	I2C_InitStructure.I2C_Mode= I2C_Mode_I2C;
	I2C_InitStructure.I2C_DutyCycle= I2C_DutyCycle_2;
	I2C_InitStructure.I2C_OwnAddress1=0x00;
	I2C_InitStructure.I2C_ClockSpeed=100000;
	I2C_InitStructure.I2C_Ack=I2C_Ack_Disable;
	I2C_InitStructure.I2C_AcknowledgedAddress= I2C_AcknowledgedAddress_7bit;
	I2C_Init(I2C1,&I2C_InitStructure);
	
	/* Enable I2C1 */
	I2C_Cmd(I2C1,ENABLE);
	
	/* Timer 7: Time Base configuration */
  TIM_TimeBaseStructure.TIM_Prescaler = 839; //clk = SystemCoreClock /2/(PSC+1)
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseStructure.TIM_Period = 9999;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
  TIM_TimeBaseInit(TIM7, &TIM_TimeBaseStructure);
	
	/* Timer 7: Enable TIM Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = TIM7_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
	/* Enable TIM7 */
	TIM_Cmd(TIM7, ENABLE);
	
	/* Enable IT TIM7 */
	TIM_ITConfig(TIM7,TIM_IT_Update,ENABLE);
	
	/* Configure PD0/PD1/PD2/PD3 pin as input floating */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
	
	/* Connect EXTI Line0 to PD0 pin */
  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOD, EXTI_PinSource0);
	/* Connect EXTI Line1 to PD1 pin */
  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOD, EXTI_PinSource1);
	/* Connect EXTI Line2 to PD2 pin */
  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOD, EXTI_PinSource2);
	/* Connect EXTI Line3 to PD3 pin */
  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOD, EXTI_PinSource3);
	
	/* Enable and set EXTI Line0 Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
	
	/* Enable and set EXTI Line1 Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
	
	/* Enable and set EXTI Line2 Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
	
	/* Enable and set EXTI Line3 Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI3_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
	
	/* Configure EXTI Line0 - Line1 - Line2 - Line3 */
  EXTI_InitStructure.EXTI_Line = EXTI_Line0 | EXTI_Line1 | EXTI_Line2 | EXTI_Line3;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;  
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);	
}

	

		/* IRQ TIM7 */
void TIM7_IRQHandler(void) 
{
	/*Clear flag timer 7*/
	TIM_ClearFlag(TIM7, TIM_IT_Update); 
	GPIO_ToggleBits(GPIOD, GPIO_Pin_12);
	
	/*Detect message from Rx then return length of message*/
	uint16_t length_mess = get_mess_from_rx(DMA1_Stream5, &pre_NDTR_USART2, BUFF_SIZE_UART2, DMA_FLAG_TCIF5);
	
	if(length_mess)
	{
		/*Take message from rx usart2*/
		char *ptr;
		ptr = (char *)calloc(length_mess,1); 
		for(int i = 0; i<length_mess; i++)
		{
			*(ptr+i) = rxbuff_uart2[i];
			/**/
			echo[i] =rxbuff_uart2[i];
		}
		
		/* Check Net Light */
		if(enable_start_up){
			if(detect_string(echo,"DONE")){
				/* Disable Start Up and Enable Task 1 */
				enable_start_up = false;
				enable_start_mqtt=true;
			}
		}
		/* Check DO */
		else if (enable_start_mqtt | enable_pub_data){
			if(detect_string(echo,"ON1")){
				GPIO_SetBits(GPIOD, GPIO_Pin_12);
			}
			else if(detect_string(echo,"OFF1")){
				GPIO_ResetBits(GPIOD, GPIO_Pin_12);
			}
			else if(detect_string(echo,"ON2")){
				GPIO_SetBits(GPIOD, GPIO_Pin_13);
			}
			else if(detect_string(echo,"OFF2")){
				GPIO_ResetBits(GPIOD, GPIO_Pin_13);
			}
			else if(detect_string(echo,"ON3")){
				GPIO_SetBits(GPIOD, GPIO_Pin_14);
			}
			else if(detect_string(echo,"OFF3")){
				GPIO_ResetBits(GPIOD, GPIO_Pin_14);
			}
		}
		/*Indicate to uart4*/
		print_uart4(ptr, length_mess);
		free(ptr);
	}
	/*rx_Selec*/
	uint16_t length = get_mess_from_rx(DMA1_Stream1,&pre_NDTR_USART3, BUFF_SIZE_UART3, DMA_FLAG_TCIF1);
	if(length)
	{
		/*Take message from rx usart2*/
		char *ptrr;
		ptrr = (char *)calloc(128,1); //allocate 100 btyes memory
		for(int i = 0; i<length; i++)
		{
			*(ptrr+i) = rxbuff_3[i]; 
			
		}
	float neutralVolt_phase1=SELEC_dataConvert(ptrr+5);
  float neutralVolt_phase2=SELEC_dataConvert(ptrr+9);
  float neutralVolt_phase3=SELEC_dataConvert(ptrr+13);
	float electricity_neutralVolt=SELEC_dataConvert(ptrr+17);
	float lineVolt_phase1 = SELEC_dataConvert(ptrr + 21);
	float	lineVolt_phase2 = SELEC_dataConvert(ptrr + 25);
	float	lineVolt_phase3 = SELEC_dataConvert(ptrr + 29);
	float electricity_lineVolt = SELEC_dataConvert(ptrr +33);
	float	current_phase1 = SELEC_dataConvert(ptrr + 37);
float current_phase2 = SELEC_dataConvert(ptrr+ 41);
float current_phase3 = SELEC_dataConvert(ptrr+ 45);
float electricity_current = SELEC_dataConvert(ptrr +49);
float kW_phase1 = SELEC_dataConvert(ptrr + 53);
float kW_phase2 = SELEC_dataConvert(ptrr + 57);
float kW_phase3 = SELEC_dataConvert(ptrr + 61);
float kVA_phase1 = SELEC_dataConvert(ptrr + 65);
float kVA_phase2 = SELEC_dataConvert(ptrr + 69);
float kVA_phase3 = SELEC_dataConvert(ptrr+ 73);
float kVAr_phase1 = SELEC_dataConvert(ptrr+ 77);
float kVAr_phase2 = SELEC_dataConvert(ptrr+ 81);
float kVAr_phase3 = SELEC_dataConvert(ptrr + 85);
float electricity_kW = SELEC_dataConvert(ptrr + 89);
float electricity_kVA = SELEC_dataConvert(ptrr + 93);
float electricity_kVAr = SELEC_dataConvert(ptrr + 97);
float PF_phase1 = SELEC_dataConvert(ptrr + 101);
float PF_phase2 = SELEC_dataConvert(ptrr + 105);
float PF_phase3 = SELEC_dataConvert(ptrr + 109);
float electricity_PF = SELEC_dataConvert(ptrr + 113);
 float electricity_frequency = SELEC_dataConvert(ptrr +117);
float electricity_kWh = SELEC_dataConvert(ptrr+ 121);
free(ptrr);
		sprintf((char *) &EEROM,"{\"V1N\":\"%.3f\",\"V2N\":\"%.3f\",\"V3N\":\"%.3f\",\"AV_LN\":\"%.3f\",\"V12\":\"%.3f\",\"V23\":\"%.3f\",\"V31\":\"%.3f\""
		",\"AV_LL\":\"%.3f\",\"I1\":\"%.3f\",\"I2\":\"%.3f\",\"I3\":\"%.3f\",\"AI\":\"%.3f\",\"KW1\":\"%.3f\",\"KW2\":\"%.3f\",\"KW3\":\"%.3f\""
	",\"KVA1\":\"%.3f\",\"KVA2\":\"%.3f\",\"KVA3\":\"%.3f\",\"KVAR1\":\"%.3f\",\"KVAR2\":\"%.3f\",\"KVAR3\":\"%.3f\",\"Total_KW\":\"%.3f\""
	",\"Total_KVA\":\"%.3f\",\"Total_KVAR\":\"%.3f\",\"PF1\":\"%.3f\",\"PF2\":\"%.3f\",\"PF3\":\"%.3f\",\"A_VF\":\"%.3f\",\"f\":\"%.3f\",\"KWH\":\"%.3f\"}"
			,neutralVolt_phase1,neutralVolt_phase2,neutralVolt_phase3,electricity_neutralVolt,lineVolt_phase1,lineVolt_phase2,lineVolt_phase3,
		electricity_lineVolt,current_phase1,current_phase2,current_phase3,electricity_current,kW_phase1,kW_phase2,kW_phase3,kVA_phase1,
		kVA_phase2,kVA_phase3,kVAr_phase1,kVAr_phase2,kVAr_phase3,electricity_kW,electricity_kVA,electricity_kVAr,PF_phase1,PF_phase2,PF_phase3,
		electricity_PF,electricity_frequency,electricity_kWh);
//		sprintf((char *) &EEROM,"neutralVolt_phase1=%f,neutralVolt_phase2=%f,neutralVolt_phase3=%f,electricity_frequency=%f\r\n",
//			neutralVolt_phase1,neutralVolt_phase2,neutralVolt_phase3,electricity_frequency);
//	USART_put(UART4, (char *) &EEROM);
//		receive(UART4, ptrr, length_mess);
//		free(ptrr);
	}
	else
	{
		//
	}
		
