nh-tu-z/stm32_firmware/main_official.c
}

/* define lai dia chi cua eeprom */
	/* EXTI PD0 */
void EXTI0_IRQHandler(void) {
	EXTI_ClearFlag(EXTI_Line0);
	uint8_t di_0 = GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_0);
	uint8_t  DI0[]={'D','I','0','=',bcd2asc(di_0)};
	eeprom_at24cxx_write_multi(DI0,0x59,5);
}

	/* EXTI PD1 */
void EXTI1_IRQHandler(void) {
	EXTI_ClearFlag(EXTI_Line1);
	uint8_t di_1 = GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_1);
	uint8_t  DI1[]={'D','I','1','=',bcd2asc(di_1)};
	eeprom_at24cxx_write_multi(DI1,0x5E,5);
}
	/* EXTI PD2 */
void EXTI2_IRQHandler(void) {
	EXTI_ClearFlag(EXTI_Line2);
	uint8_t di_2 = GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_2);
	uint8_t  DI2[]={'D','I','2','=',bcd2asc(di_2)};
	eeprom_at24cxx_write_multi(DI2,0x63,5);
}
	/* EXTI PD3 */
void EXTI3_IRQHandler(void) {
	EXTI_ClearFlag(EXTI_Line3);
	uint8_t di_3 = GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_3);
	uint8_t  DI3[]={'D','I','3','=',bcd2asc(di_3)};
	eeprom_at24cxx_write_multi(DI3,0x68,5);
}
/* Hàm chuyen kieu ASCII sang BCD */
uint8_t string2BCD(char tenDigit, char oneDigit)
{
uint8_t bcdOut = 0;
bcdOut = (tenDigit - '0') << 4;
bcdOut |= (oneDigit - '0');
return bcdOut;
}
/* Hàm chuyen kieu BCD sang ASCII */
bool BCD2String(uint8_t bcd, char *desString)
{
desString[0] = (bcd >> 4) + '0';
desString[1] = (bcd & 0x0F) + '0';
return true;
}

/* Hàm chuyen kieu BCD sang DEC */
uint8_t BCD2DEC(uint8_t data)
{
return ((data >> 4) * 10 + (data & 0x0f));
}
uint8_t  DEC2BCD(uint8_t data)
{
return ((data / 10) << 4 | (data % 10));
}


void I2C_start(I2C_TypeDef* I2Cx, uint8_t address, uint8_t direction) {
    // wait until I2C1 is not busy any more
    while (I2C_GetFlagStatus(I2Cx, I2C_FLAG_BUSY))
        ;

    // Send I2C1 START condition
    I2C_GenerateSTART(I2Cx, ENABLE);

    // wait for I2C1 EV5 --> Slave has acknowledged start condition
    while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT))
        ;

    // Send slave Address for write
    I2C_Send7bitAddress(I2Cx, address, direction);

    /* wait for I2Cx EV6, check if
     * either Slave has acknowledged Master transmitter or
     * Master receiver mode, depending on the transmission
     * direction
     */
    if (direction == I2C_Direction_Transmitter) {
        while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
            ;
    } else if (direction == I2C_Direction_Receiver) {
        while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
            ;
    }
}

uint8_t I2C_read_ack(I2C_TypeDef* I2Cx) {
    // enable acknowledge of received data
    I2C_AcknowledgeConfig(I2Cx, ENABLE);
    // wait until one byte has been received
    while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_RECEIVED))
        ;
    // read data from I2C data register and return data byte
    uint8_t data = I2C_ReceiveData(I2Cx);
    return data;
}


uint8_t I2C_read_nack(I2C_TypeDef* I2Cx) {
    // disable acknowledge of received data
    // nack also generates stop condition after last byte received
    // see reference manual for more info
    I2C_AcknowledgeConfig(I2Cx, DISABLE);
    I2C_GenerateSTOP(I2Cx, ENABLE);
    // wait until one byte has been received
    while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_RECEIVED))
        ;
    // read data from I2C data register and return data byte
    uint8_t data = I2C_ReceiveData(I2Cx);
    return data;
}

void I2C_stop(I2C_TypeDef* I2Cx) {
    // Wait until end of transission
    while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
        ;
    // Send I2C1 STOP Condition after last byte has been transmitted
    I2C_GenerateSTOP(I2Cx, ENABLE);
    // wait for I2C1 EV8_2 --> byte has been transmitted
    while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
        ;
}

void I2C_write(I2C_TypeDef* I2Cx, uint8_t data) {
    // wait for I2C1 EV8 --> last byte is still being transmitted (last byte in SR, buffer empty), next byte can already be written
    while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
        ;
    I2C_SendData(I2Cx, data);
}

int ds1307_set_rtc_data (char register_value, char data) {
    USART_put(USART3, "ds1307_set_rtc_data A entered\r\n");
    I2C_start(I2C1, (DS1307_ADDRESS << 1), I2C_Direction_Transmitter);
    USART_put(USART3, "ds1307_set_rtc_data B entered\r\n");
    I2C_write(I2C1, register_value);
    //USART_put(USART2, "ds1307_set_rtc_data B entered\r\n");
    I2C_write(I2C1, data);
    //USART_put(USART2, "ds1307_set_rtc_data B entered\r\n");
    I2C_stop(I2C1);
   // USART_put(USART2, "ds1307_set_rtc_data C entered\r\n");

    // otherwise success
    return RTC_DS1307_OK;
}
int ds1307_get_rtc_data (char register_value, char register_mask,
    unsigned int *return_value) {
    //uint8_t out_buff[1];
    uint8_t in_buff[1];
    //uint32_t status;

    I2C_start(I2C1, (DS1307_ADDRESS << 1), I2C_Direction_Transmitter);
    I2C_write(I2C1, register_value);
    I2C_stop(I2C1);

    I2C_start(I2C1, (DS1307_ADDRESS << 1), I2C_Direction_Receiver);
    in_buff[0] = I2C_read_nack(I2C1);
    
    // otherwise success
    *return_value = BCD2BIN(in_buff[0] & register_mask);
    return RTC_DS1307_OK;
}
		
void ds1307_set_rtc_second (unsigned int value) {
    ds1307_set_rtc_data(SECOND_REGISTER, (BIN2BCD(value) & SECOND_MASK));
}

void ds1307_set_rtc_minute (unsigned int value) {
    ds1307_set_rtc_data(MINUTE_REGISTER, (BIN2BCD(value) & MINUTE_MASK));
}

void ds1307_set_rtc_hour (unsigned int value) {
    ds1307_set_rtc_data(HOUR_REGISTER, (BIN2BCD(value) & HOUR_MASK));
}

void ds1307_set_rtc_day (unsigned int value) {
    ds1307_set_rtc_data(DAY_REGISTER, (BIN2BCD(value) & DAY_MASK));
}

void ds1307_set_rtc_date (unsigned int value) {
    ds1307_set_rtc_data(DATE_REGISTER, (BIN2BCD(value) & DATE_MASK));
}
void ds1307_set_rtc_month (unsigned int value) {
    ds1307_set_rtc_data(MONTH_REGISTER, (BIN2BCD(value) & MONTH_MASK));
}

void ds1307_set_rtc_year (unsigned int value) {
    ds1307_set_rtc_data(YEAR_REGISTER, (BIN2BCD(value) & YEAR_MASK));
}

int ds1307_set_rtc_datetime (rtc_ds1307_datetime_t* datetime) {
    // Set RTC datetime, the write format is documented on ds1307 
    // byte0: word address = 0x00
    // byte1: (seconds)
    // byte2: (minutes)
    // 3: day
    // 4: date (day of month)
    // 5: month
    // 6: year (0-99)
    I2C_start(I2C1, (DS1307_ADDRESS << 1), I2C_Direction_Transmitter);
    I2C_write(I2C1, 0x00);
    I2C_write(I2C1, BIN2BCD(datetime->seconds) & SECOND_MASK);
    I2C_write(I2C1, BIN2BCD(datetime->minutes) & MINUTE_MASK);
    I2C_write(I2C1, BIN2BCD(datetime->hour) & HOUR_MASK);
    I2C_write(I2C1, BIN2BCD(datetime->day) & DAY_MASK);
    I2C_write(I2C1, BIN2BCD(datetime->date) & DATE_MASK);
    I2C_write(I2C1, BIN2BCD(datetime->month) & MONTH_MASK);
    I2C_write(I2C1, BIN2BCD(datetime->year) & YEAR_MASK);
    I2C_stop(I2C1);

    // otherwise success
    return RTC_DS1307_OK;
}

