nh-tu-z/stm32_firmware/main_official.c
int ds1307_get_rtc_second (void) {
    return ds1307_get_rtc_data(SECOND_REGISTER, SECOND_MASK, &g_return_value);
}

int ds1307_get_rtc_minute (void) {
    return ds1307_get_rtc_data(MINUTE_REGISTER, MINUTE_MASK, &g_return_value);
}

int ds1307_get_rtc_hour (void) {
    return ds1307_get_rtc_data(HOUR_REGISTER, HOUR_MASK, &g_return_value);
}

int ds1307_get_rtc_day (void) {
    return ds1307_get_rtc_data(DAY_REGISTER, DAY_MASK, &g_return_value);
}

int ds1307_get_rtc_date (void) {
    return ds1307_get_rtc_data(DATE_REGISTER, DATE_MASK, &g_return_value);
}

int ds1307_get_rtc_month (void) {
    return ds1307_get_rtc_data(MONTH_REGISTER, MONTH_MASK, &g_return_value);
}

int ds1307_get_rtc_year (void) {
    return ds1307_get_rtc_data(YEAR_REGISTER, YEAR_MASK, &g_return_value);
}

int ds1307_get_rtc_datetime (rtc_ds1307_datetime_t *datetime)
{
    // seconds
    if (ds1307_get_rtc_second() != RTC_DS1307_OK)
        return RTC_DS1307_BAD;
    else
        datetime->seconds = g_return_value;

    // minutes
    if (ds1307_get_rtc_minute() != RTC_DS1307_OK)
        return RTC_DS1307_BAD;
    else
        datetime->minutes = g_return_value;

    // hours
    if (ds1307_get_rtc_hour() != RTC_DS1307_OK)
        return RTC_DS1307_BAD;
    else
        datetime->hour = g_return_value;

    // day
    if (ds1307_get_rtc_day() != RTC_DS1307_OK)
        return RTC_DS1307_BAD;
    else
        datetime->day = g_return_value;

    // date
    if (ds1307_get_rtc_date() != RTC_DS1307_OK)
        return RTC_DS1307_BAD;
    else
        datetime->date = g_return_value;

    // month
    if (ds1307_get_rtc_month() != RTC_DS1307_OK)
        return RTC_DS1307_BAD;
    else
        datetime->month = g_return_value;

    // year
    if (ds1307_get_rtc_year() != RTC_DS1307_OK)
        return RTC_DS1307_BAD;
    else
        datetime->year = g_return_value;

    // otherwise, success
    return RTC_DS1307_OK;
}
int ds1307_init_rtc (int first_run_flag) {
    // build the default (zero) starting state for the RTC
    // datetime structure.
    rtc_ds1307_datetime_t init_datetime = {
        .year = 21,
        .month = 05,
        .date = 12,
        .day = 03,
        .hour = 13,
        .minutes = 10
			,
        .seconds = 00
    };

   // USART_put(USART3, "ds1307_init_rtc entered\r\n");
    if (ds1307_set_rtc_data(CONTROL_REGISTER, 0) == -1) {
        return RTC_DS1307_BAD;
    }

    if (first_run_flag) {
        return ds1307_set_rtc_datetime(&init_datetime);
        
    }
    // otherwise return 0 to indicate success
    return RTC_DS1307_OK;
}


uint8_t eeprom_at24cxx_read_multi(uint8_t* memaddress,
	uint16_t address,uint16_t num_of_byte)
{
	uint8_t timeout;
	uint8_t addhigh = address>>8;
	uint8_t addlow = address&0xff;
		
	// start
	I2C_GenerateSTART(I2C1,ENABLE);
	timeout = 100;
	while ((!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_MODE_SELECT))&&(timeout))
	{
		delay_01ms(100);
		timeout--;
	}
	if (timeout == 0)
	{
		I2C_GenerateSTOP(I2C1,ENABLE);
		return 0;
	}
	
	// send address + W
	I2C_Send7bitAddress(I2C1,EEPROMADDR,I2C_Direction_Transmitter);
	timeout = 100;
	while ((!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))&&(timeout))
	{
		delay_01ms(100);
		timeout--;
	}
	if (timeout == 0)
	{
		I2C_GenerateSTOP(I2C1,ENABLE);
		return 0;
	}
	
	// send reg address (dummy write)
	I2C_SendData(I2C1,addhigh);
	while (!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_BYTE_TRANSMITTED))
	{
	}
	I2C_SendData(I2C1,addlow);
	while (!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_BYTE_TRANSMITTED))
	{
	}
	
	// start repeated
	I2C_GenerateSTART(I2C1,ENABLE);
	while (!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_MODE_SELECT))
	{
	}
	
	// send address + R
	I2C_Send7bitAddress(I2C1,EEPROMADDR,I2C_Direction_Receiver);
	while (!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
	{
	}
	
	// read multi byte
	I2C_AcknowledgeConfig(I2C1,ENABLE);
	while(num_of_byte)
	{
		if (num_of_byte == 1)
		{
			I2C_AcknowledgeConfig(I2C1,DISABLE);
		}
		while (!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_BYTE_RECEIVED))
		{
		}
		*memaddress = I2C_ReceiveData(I2C1);
		memaddress++;
		num_of_byte--;
	}	
	
	// stop
	I2C_GenerateSTOP(I2C1,ENABLE);
	delay_01ms(500);
	return 1;	
}


static uint8_t eeprom_at24cxx_write_page(uint8_t* memaddress,
	uint16_t pageaddress,uint16_t num_of_byte)
{
	uint8_t timeout;
	uint8_t addhigh = pageaddress>>8;
	uint8_t addlow = pageaddress&0xff;
		
	// start
	I2C_GenerateSTART(I2C1,ENABLE);
	timeout = 10;
	while ((!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_MODE_SELECT))&&(timeout))
	{
		delay_01ms(100);
		timeout--;
	}
	if (timeout == 0)
	{
		I2C_GenerateSTOP(I2C1,ENABLE);
		return 0;
	}
	
	// send address + W
	I2C_Send7bitAddress(I2C1,EEPROMADDR,I2C_Direction_Transmitter);
	timeout = 30;
	while ((!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))&&(timeout))
	{
		delay_01ms(100);
		timeout--;
	}
	if (timeout == 0)
	{
		I2C_GenerateSTOP(I2C1,ENABLE);
		return 0;
	}
	
	// send reg address 
	I2C_SendData(I2C1,addhigh);
	while (!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_BYTE_TRANSMITTED))
	{
	}
	I2C_SendData(I2C1,addlow);
	while (!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_BYTE_TRANSMITTED))
	{
	}

	// write multi byte
	while(num_of_byte)
	{
		I2C_SendData(I2C1,*memaddress);
		while (!I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_BYTE_TRANSMITTED))
		{
		}
		memaddress++;
		num_of_byte--;
	}	
	
	// stop
	I2C_GenerateSTOP(I2C1,ENABLE);
	return 1;
}



uint8_t eeprom_at24cxx_write_multi(uint8_t* memaddress,
	uint16_t romaddress,uint16_t num_of_byte)
{
	uint16_t num_of_byte_write;
	uint8_t write_result;
	uint8_t first_page_remain = 32 - romaddress&0x001F;
	uint8_t first_page = 1;
	
	while(num_of_byte)
	{
		if (first_page)
		{
			if (num_of_byte > first_page_remain)
			{
				num_of_byte_write = first_page_remain;
			}
			else
			{
				num_of_byte_write = num_of_byte;
			}
			first_page = 0;
		}
		else
		{
			if (num_of_byte > 32)
			{
				num_of_byte_write = 32;
			}
			else
			{
				num_of_byte_write = num_of_byte;
			}
		}
		
		num_of_byte -= num_of_byte_write;
		
		write_result = eeprom_at24cxx_write_page(memaddress,romaddress,num_of_byte_write);
		memaddress += num_of_byte_write;
		romaddress += num_of_byte_write;
		delay_01ms(500);;
		if (write_result == 0)
		{
			return 0;
		}
	}
	
	delay_01ms(500);
	return 1;
}
	bool clearString(char *srcString)
{
    uint32_t length = lengthString(srcString);
    for (uint32_t i = 0; i < length; i++)
        srcString[i] = 0;
    return true;
}
uint32_t lengthString(char *string)
{
    uint32_t length = 0;
    while ((string[length] != 0) && (length < 2048))
        length++;
    return length;
}

